Repository: smmac72/cv_site
Catalog: app/translations/*/LC_MESSAGES/messages.po
Languages: ru

source: Solo activities are cool too. Talking about online games now. I have one rule - surely, it's a solo minigame, but the player shouldn't feel himself lonely. There's always somebody close, there quick small interactions can make any activity much more interesting! Let me tell about a couple of my projects here.
ru: Соло активности - это классно! В плане в онлайн играх. У меня одно правило при работе с таким - это соло миниигрушка, но игрок не должен чувствовать себя одиноко. Всегда есть кто-то рядом, а вот эти мелкие интеракции могут сделать все куда интереснее! Пожалуй тут время рассказать о паре моих фичей такого формата

source: A very casual bus-driving job. As a former ETS enjoyer I understand the pleasure, but casual players can get tired of this stuff pretty quickly. Let's give a bit more interactivity. Obviously, almost nobody would visit this lonely bus driver, making his money driving in circles. Some interactive bus stops will attract attention of players. Let them use these stops as in-game Google Maps. Now players know that these mysterious bus drivers do indeed exist. They take a bus and see the ability to choose any bus stop on this route to get off. The driver just gets a notification, no need for unwanted interactions here. Sometimes these small moments for unique players fully justify the production cost.
ru: Банальная работа водителя автобуса. Я как полноценный ETS enjoyer понимаю удовольствие от такой активности, но казуальные игроки просто устанут от этого, причем достаточно быстро. Дадим немного интерактивности, а то никто так и не посетит одинокого автобусника, который катает круги за софту. Интерактивные остановки, которые игроки могут использовать как Яндекс Карты, точно привлекут внимание людей. Теперь они знают, что существуют эти водители автобусов. Предположим, они захотят прокатиться. А мы возьмем и дадим им возможность оповестить водителя, на какой остановке их остановить. Нет, не текстом, а полноценной менюшкой. Водитель не отвлекается, но знает, что с ним в этой муторной активности есть другие игроки. Честно, такие маленькие моменты удовольствия оправдывают стоимость и время разработки.

source: A bit easier now. Remember all these activities which look very-very boring? Fishing, for example. Let's have a fishing minigame! Not a 'Fishing Simulator'-esque, just something simple to drop a few hours after a long day. Some fishing items - great! Give a small competition between players (like a really friendly one) to that - everyone loves a competition! A bit of a skill system and that's all players need for such a simple activity.
ru: Чуть полегче. Все же знают о существовании очень-очень скучных на первый взгляд активностей, типа рыбалки. Лично я знаю, и единственная рыбалка в моей жизни была максимально скучным опытом. А давайте перенесем этот прекрасный опыт в свой проект! Не аналог симулятора рыбалки, куда казуальнее, чтобы просто завалиться после тяжелого дня позалипать. Сверху накинем магазин рыболовных айтемов для вывода капельки софты. Накидываем какое-нибудь микро-соревнование (прям совсем дружелюбное) - все любят такие соревнования! Система скиллов, чтобы можно было ожидать чего-то еще от системы. Да и собственно все, даже такую скучную идею как рыбалку можно принести в виде расслабляющей активности тайм-киллера!

source: ... and some time together
ru: ... и время в компании

source: Let's have a little monologue of mine about getting players together. Factions, of course, the oldest trick in the book! It happens that I have something to say about these mechanics too.
ru: Это мой маленький монолог о том, как можно сгруппировать игроков. Конечно же в формате фракций, старейший трюк в книге! Удивительно, но и про это я могу что-то сказать.

source: In a project based on human interaction, you need a strong leader for a faction. Sometimes that's a huge problem. It's hard to control absolutely random people, you know. The only way for project staff to keep it cool is to eliminate these players or give them something to do. Interesting features attract anyone.
ru: В проекте, чей кор это взаимодействие игроков путем говорения (ну я и сказал конечно, я бы это исправил, но это слишком платина), для фракций нужен сильный лидер. Иногда это проблемно. Сложно контролировать абсолютно случайных людей. Как это может починить команда? Убрать неприятных игроков, к примеру. Или завлечь их интересными фичами. Второй вариант звучит интереснее.

source: Basic concept, cops and robbers. Seems enough for some time, but the time this concept becomes boring will surely come and players will start ruining others' gameplay in search of something interesting. Give these cops and robbers some more functionality against each other. Let cops be able to trace criminals with some counter-feature like signal jamming from the criminals. Criminals can raid cops for a quick interaction and to steal their weaponry. It's risky coming right at enemy's base, but it's a rewarding process. Here you go, a very simple concept gets a cool feature to allow people enjoy this. Bored again? Add one more faction from each side - army and mafia. Even the simplest concept can be evolved into something really complex.
ru: Базовый концепт - законники против преступников. Звучит прикольно на первые моменты, но со временем это надоест, игроки начнут творить херню и будут руинить геймплей остальным в поисках чего-то веселого (ну или просто уйдут). Дадим законникам функционал отслеживать преступников, накинем на это контрмеру в виде глушилок. Криминалу же дадим возможность рейдить базы законников для получения оружия. Контрмера тут не нужна, это и так рискованно приходить на респаун противника, но процесс оправдывает себя наградой. Вот и простой концепт, который позволит людям дальше получать удовольствие. Снова надоело? Добавим еще по фракции с каждой стороны - условные армии и мафии. Самый простой концепт может оказаться в будущем чем-то искренне большим и сложным.

source: Alright, say it's pretty hard to keep updating this system. Just give players ability to create their own factions. People are pretty interesting, they'll form up a conflict by themselves. Give them a base, something to do, they'll be happy to have some fun!
ru: Окей, предположим сложно поддерживать это все. Дадим просто игрокам возможность создавать свои собственные фракции. Люди сами по себе интересные, они самостоятельно сформируют конфликт и разойдутся минимум по две стороны. Дать им базу, какие-нибудь активности между собой и между этими кланами, да и пусть веселятся. А они будут!

source: Actually, talking about both of these concepts, I've taken part in a project where both ideas reached production. A simple cops and robbers idea was taken to more than ten different factions. On the other hand, unofficial factions were forming with our attempts to support this feature. Trust me, these concepts work great together!
ru: На самом деле, говоря про оба этих концепта, мне посчастливилось побывать в проекте, где обе идеи вышли в прод (правда в каплю другой реализации). Простая стрелялка между полицией и криминалом перешла более чем в десяток разных фракций. С другой стороны куча мелких неофициальных фракций, которые стали популярнее с релизом обновлений для их механик. Поверьте мне, эти концепты замечательно работают в паре!
