Repository: smmac72/cv_site
Catalog: app/translations/*/LC_MESSAGES/messages.po
Languages: ru

source: it's me, zeromac!
ru: зовите меня zeromac

source: or just Oleg
ru: или просто Олег

source: professional info
ru: рабочее

source: personal info
ru: персональное

source: contact me
ru: контакты

source: catch all the stars!
ru: поймай все звезды!

source: why you should hire me
ru: почему я?

source: So, I've been working as a game-designer in balance and features for the last three years. My main sphere is MMORPG games with an emphasis on simulating some real-life activities. Mostly aiming to continue working with projects aimed to let people interact in virtual spaces.
ru: Работаю геймдизайнером по балансу и фичам последние три года. Основная сфера - MMORPG игрушки с упором в симуляцию активностей из наших жизней. Планирую продолжать работу в проектах, дающих людям возможность интерактировать в таких виртуальных пространствах.

source: Spent some time in indie studios, had a bit of experience in casual mobile games. Sometimes I take part in consulting indie developers and small studios, mostly from my area of interest.
ru: Провел немного времени в индюшках, получил опыт работы с мобильными казулками. Сейчас иногда выполняю роль консультанта для независимых разработчиков или небольших студий.

source: Was working on features from idea to product release with product managers, developers and designers. Have basic knowledge of the idea of analytics. Had been working with a couple game-dev analytics. Gotta say honestly, a bit rusty, but nothing that ten minutes in google can't fix
ru: Проводил фичи от идеи до выхода в прод совместно с проект-менеджерами, разработчиками и дизайнерами. Базово работал с аналитикой. Может сейчас и помню это как давний опыт, но десять минут в гугле могут починить даже такое.

source: Currently working on a pet-project in Unreal Engine 4. Playing with some third-person shooter concepts.
ru: Сейчас работаю над пет-проектом в UE4. Играюсь с концептами, которые могли бы хорошо влиться в шутер от третьего лица.

source: If you want to know more, there's a small clicker game somewhere in this CV. It's more of my personal experience with some feautures. Have fun!
ru: Если желаете узнать больше, все резюме - небольшой кликер, который приведет к моему какому-то личному опыту работы с различными фичами. Have fun!

source: i am interesting
ru: я честно интересный!

source: that's literally me
ru: это я!!

source: Name's Oleg, living in
ru: По некому стечению обстоятельств меня зовут Олег, живу в

source: constant pain
ru: постоянной боли

source: Russia for the most part of my 20-year life. Majoring in Computer Science at Saint-Petersburg State University, left Moscow for this beautiful city.
ru: России большую часть своих 20 лет жизни. Обучаюсь в СПбГУ на направлении Программная Инженерия, приехал сюда из Москвы ради этого прекрасного города!

source: I was playing computer games since childhood, but found myself in lots of different places. Favorite hobby's cooking, I've been learning to cook since the age of 14. Also I've been studying massage practices from all over the world (mostly Thailand and Caribbean). Two years of mixing drinks, two of my absolute favorites are white russian and cuba libre. If you're not an HR or at least a friendly one, my doors are always open. Always can let you cry on my shoulder, my bros.
ru: С самого детства играл в компьютерные игрушки, но нашел себя в куче разных вещей. Любимое хобби - кулинарные штуки. Учился готовить лет с 14. Умею в массаж, изучал практики из совершенно разных стран (но в основном Таиланд и Карибы). Два года барного опыта привели к двум любимым коктейлям - белый русский и куба либре. Если вы не мой рекрутер, или очень дружелюбный рекрутер, мои двери всегда открыты, и мне можно поплакаться или посидеть вместе за пивом!

source: Sounds stereotypical, but I enjoy travelling with 20+ countries on my list. Gotta hit it up to 193 if our borders open sometimes..
ru: Максимальный стереотип, конечно, но я люблю путешествовать. Сейчас на счету более 20 стран, но если границы снова откроют, буду добиваться всех 193 стран в своем чеклисте!

source: Wow, an interesting fact! I'm fluent in Russian. Who could've guessed... I guess I can also make up a few sentences in English. Was trying to learn French, but my max is bumming a cigarette :(
ru: Немного знаю английский (внизу слева есть кнопка смены языка, если нужно подтверждение хаха), изучал его примерно 15 лет. Пытался выучить французский, но дальше стреляния сигарет на улицах Парижа не ушло :(

source: If you're an HR looking at another CV, gotta give you something, right? Everyone is writing about their personal qualities, so here we go
ru: Если это читает рекрутер, мне нужно что-то дать, да? Все пишут про свои персональные качества, почему бы мне не сделать так же

source: Friendly and easy to get on with, I guess. Have lots of experience talking to people, I kinda like it...
ru: Дружелюбный и вообще комфортный человек, вероятно. Много общаюсь с людьми, люблю это делать всей душой

source: Fast learner. Just take a look at this CV, I have one night of experience in web development. At least it hasn't broken yet
ru: Быстро обучающийся. Можно просто глянуть на все мое резюме, которое было написано за ночь опыта в веб-разработке. Хотя бы держится

source: Stress tolerance. Perhaps. We all experience stress in our own ways. Can't deny I have lots of stressful things around me, but I can live with that
ru: Стрессоустойчивость. Тоже вероятно. Мы все-таки все испытываем стресс как-то по-своему. Не могу отрицать, что стресса много, но проблем он не приносит

source: Initiative, but that's certainly a bad trait sometimes. Don't do extra work if nobody gives a shit, that's bad for your mental health, fellas!
ru: Инициативность, но это иногда уж точно плохая привычка. Не перерабатывайте, солнцы :(

source: I am certainly a team person. As a member, as a leader, you name it. People with the same goal always give you extra determination
ru: Командный. Как член команды, как ее лидер, вообще без разницы. Люблю факт того, что люди вокруг с такой же целью дают тебе немного решительности

source: i'll answer you immediately
ru: Я постараюсь ответить!

source: email
ru: Электронная почта

source: please don't call me in telegram in 3am, i'm tilting. cheers!
ru: не звоните пожалуйста в телеге в три ночи, у меня запланированный тильт. спасибо!

source: this feature will work. probably.
ru: эта фича должна работать. вероятно.

source: That's my base and ABSOLUTELY favorite thing to do. There's actually not much to say, you get your assignment from the product manager or your lead, look at your project in search of some point you can start from, then you create your masterpiece! I have experience in working on completely new features, updating old ones and covering both of these types with documentation. The only thing I'm gonna show is my own documentation structure. Everyone has one, sometimes it's something given by the your team, in other cases you form the rules all by yourself. So here's mine!
ru: Собственно, это кор моей работы и АБСОЛЮТНО одна из самых любимых ее частей. Написание документации это достаточно простой процесс, получаешь таск от ПМа или от лида, ищешь в проекте точки, за которые можешь зацепиться и строчишь свой шедевр. У меня есть опыт работы с разработкой новых фичей, обновлением старых, а также с поддержанием документации для обоих типов выше в соло и в команде. Особо не знаю, что тут написать, скажу про формат документации, который различается у проектов и отдельных геймдизайнеров. Оставлю тут свой что ли.

source: <b>Feature name</b> || Cool name is half of your job done
ru: <b>Название фичи</b> || Классное название - это половина работы!

source: <b>Short description</b> || Just a few sentences about functionality
ru: <b>Краткое описание</b> || Пара предложений насчет функциональной составляющей

source: <b>Target audience</b> || Think about caterogies of players who need this mechanic
ru: <b>Целевая аудитория</b> || Подумайте о типах игроков, которым нужна эта механика

source: <b>Feature target</b> || Now understand what this feature can do for these players
ru: <b>Цель</b> || А теперь осознайте, зачем она им нужна

source: <b>Targeted metrics</b> || I usually have three types of features - making gameplay richer, monetization stuff and keeping the engagement of your project high
ru: <b>Влияние на метрики</b> || Для меня самая база это три типа фичей - расширение геймплейных способностей, монетизация и удержание игроков

source: <b>Long description</b> || That's like a short description, but a long one! Get every element of your feature, try to understand every condition, work with every case. Rich feature coverage in your documentation is the main part of your success!
ru: <b>Описание</b> || Это как краткое описание, но не краткое. Берется каждый элемент фичи, расписывается максимально подробно. Покрыть каждый вариант использования механики - главная часть успеха как в разработке, так и при выходе в прод

source: <b>Balance</b> || Don't keep your numbers in the description. Just refer to this paragraph, so it's easier to keep and edit everything number-related
ru: <b>Баланс</b> || Все цифры фичи идут сюда. Легче держать их в отдельном разделе для удобства редактирования

source: <b>Design stuff</b> || Mostly mockups of UI and 3D (or 2D, but I've never worked with two-dimensional worlds in games). Explain what you need from visuals.
ru: <b>Мокапы</b> || Пункт для дизайнеров, которые будут создавать интерфейс, либо визуальные ассеты. Тут просто можно объяснить, как должна выглядеть и функционировать визуальная часть

source: I've developed this easy structure, but I'm willing to move over to other documentation formats if needed. Don't forget, documentation is half of the feature, make it a great half!
ru: Я разработал такую простую структуру за время своей работы, но вполне могу переехать на иной формат при наличии стандарта в команде. Но самое главное, что нельзя забывать, это то, что документация - половина самой фичи, так что сделайте ее классной половиной!

source: war crimes are better with some friends!
ru: Военные преступления веселее с друзьями!

source: Ok, that's a page of mostly me trying to understand shooters. Guns are cool because of the movie culture, so people love them. I've taken part in two weapon-based features.
ru: Это больше моя попытка понять шутеры. Спасибо влиянию медиа, теперь стрелять это круто и всем нравится. Я как раз поучаствовал в разработке пары фичей, ориентированных на пострелять.

source: First one way quite easy, that's a faction stuff (link somewhere in my CV). Balance a few weapons, give them a reasonable cost and ways of getting your hands on them. A bit of a number tinkering. What can be better? I absolutely love it!
ru: Сначала с простого, дать двум фракциям (говорят, где-то можно найти мой рассказ про фракции тут!) немного пострелять. Сбалансировать несколько стволов, дать адекватную стоимость, сверху накинуть интересных путей для их добычи. В основном поиграться с числами, а разве не это самое классное!

source: Now onto some complex stuff. A well crafted system with lots of behaviorally different weapons. Attachments, upgrade, gameplay features based on interaction between players via weapons. Awesome soft currency sink. Was one of my favorite features until most of it became based on the hard currency. Felt bad. So much revenue in day1, I even couldn't upgrade one weapon to its max level, there was less hard currency on my test accounts.
ru: А теперь к чуть более сложному. Качественная система с поведенчески разным вооружением. Куча аттачментов, улучшений, геймплейных фичей на интеракцию между игроками с помощью оружия. Идеальный слив софты! Это была одна из моих любимых фичей, пока я не узнал, что ее до релиза решили перевести на харду. Ощущается дискомфорт. Зато столько ревенью покатило в день выхода в прод, хотя я на тестах даже не мог себе с нарисованной хардой позволить последний уровень апгрейда.

source: That's just one way to let people interact with each other. And surely, it's a fun way! Current generation grew up on shooters, we're kinda used to instinctively pressing LMB to shoot and raging on skilled opponents.
ru: Это всего лишь один способ дать людям возможность интерактировать друг с другом. И конечно же это веселый путь! Наше поколение выросло на шутерах, и мы как-то уже привыкли инстинктивно нажимать ЛКМ для выстрела, а потом рейджить на скилловых оппонентов.

source: balancing the most broken
ru: балансим самое сломанное

source: I love money! I mean soft currency, which is always losing its cost. I'm no economist, but this process can be slowed down a little. Perhaps.
ru: Я люблю деньги! В плане софту, которая всегда теряет свою цену в сообществе игроков. Я конечно не экономист, но вероятно этот процесс можно чуточку замедлить.

source: Actually, that was my last job and.. damn, that was a really long journey for me. I've been fiddling with almost every in-game system, the economy there went down really bad.
ru: На самом деле, это был мой последний таск, и как же это лучше выразить... это было долгое приключение для меня. Лез почти в каждую систему, экономика была в крайне неприятном состоянии

source: First of all, you gotta isolate the whole economical system. There's already lots of sort currency there, won't be a problem. Just stop introducing more money to this poor economy :(. Some players were getting money from the system? Create an in-game fund, like a government treasury, let people pay taxes. The only way to introduce more money is your donate system. And trust me, after a while it'll be a blessing for your paying playerbase.
ru: Начнем с изоляции экономической системы. У игроков и так много денег, надо прекратить вливать еще больше в эту бедную экономику :(. Игроки получали деньги от системы? Мое решение было поставить это все на 'государственную казну', заставив игроков платить налог. У нас остается один вариант влива софты в экономику - это донат, который через некоторое время наберет обороты как никогда!

source: Alright, now onto player earnings. Dive in your legacy mechanics, fiddle with them for some time. Perhaps you have a poorly balanced activity from the past. Don't lower the payouts massively, nobody likes that. Just bring everything to 'I guess that's ok' level.
ru: С этим разобрались, теперь посмотрим, как зарабатывают игроки. Лезем в легаси механики, с ними бывает очень интересно поиграться. Я уверен, что есть хотя бы одна не совсем сбалансированная активность из прошлого, время этим заняться. Конечно не надо снижать все выплаты из-за новой экономической системы, просто доведите их до уровня 'вроде ок'

source: Now some gold sinks, of course. Let people buy a few unique items for sort currency. Give 'em lots of small money sinks. That's a long process, but your economy should stabilize at least a little. No more new soft currency, everything's exchanged between players. God bless American Euro!
ru: Теперь сливаем софту. Даем игрокам на покупку несколько уникальных айтемов, загружаем кучу мелких сливов. Это долгий процесс, но экономика хоть чуточку стабилизируется. Господь благослави гривны!

source: mom can I get 20 bucks
ru: ма, а можно на покушать кинуть?

source: Wanna lead a prosperous project? Make your playerbase pay you for virtual images! The more they pay, the more
ru: Хочешь вести процветающий проект? Заставь игроков платить за картинки! Больше они платят, больше

source: bottles of 21 year old Glenfiddich you can bring to your office!
ru: бутылок Гленфиддика 21 лет выдержки можно принести в офис!

source: you can invest back!
ru: можно вложить обратно в свой проект!

source: I've been working on a few features aimed at increasing ARPPU. Let me give you a quick tour on this
ru: Я работал над несколькими монетизационными фичами. Давайте тут тоже быстренько пройдемся

source: Exchanging money for in-game abilities, unique features (my absolutely favorite - ability to turn off your in-game phone in one project), skins - that's the basic stuff. One of the main problems for me was trying to find something valuable for players to be willing to donate. Exchanging real money for soft currency is easier. The only question - will your economical system hold?
ru: Обмен денег на пиксели или на внутриигровые способности (моя абсолютно любимая - возможность выключить игровой телефон в одном проекте) - это классика. Основная проблема - найти что бы такое продать, за что игроки будут платить. С хардой куда легче, ее всегда будут покупать. Если есть перевод харды в софту, остается один вопрос - выживет ли игровая экономика?

source: Constant monetization on sticky players. The concept of a battlepass is one of the best inventions in game-dev history. Player gives you money to play even more?. Damn, that's hot! Give them some tasks (that's a quests page, if interested, there's a lot of my soul!), a bit of rewards, that's an active paying player for you!
ru: Постоянная монетизация на активных игроках. Концепт баттлпасса - одно из лучших изобретений в онлайн игрушках. Игрок дает тебе деньги просто чтобы еще поиграть? Вот это тема! Накинуть сверху задач (я писал про квесты, если не видели, рекомендую! там много души излито хаха), еще наград и вот - образцовый платящий игрок!

source: haha cases. Balancing the costs, chances to get an item, that's some cool basic math stuff! There's not much I can say about random drops, it's a pretty straightforward process. But yup, I have some experience with this line of work too.
ru: хаха кейсы. Забалансить стоимость, шансы - база, а база это всегда хорошо. Я не знаю, что можно написать насчет этого формата, это достаточно прямолинейный процесс. Но да, у меня есть опыт и в этом тоже!

source: On the other hand, I truly despise some donate strategies. No, it brings money, but sometimes it is ABSOLUTELY AWFUL. Nah dudes, I ain't making a ten year old pay a hundred bucks stolen off his mother. Had this experience, saw our team's conversation with his mother. Felt awful
ru: Ладно, если честно, во мне есть внутренняя ненависть к некоторым стратегиям монетизации. Да, приносит деньги, но не все пути для этого хороши. Не, я не буду смотреть, как десятилетний ребенок тратит на пиксели спизженный у мамы косарь. Было дело, видел диалог саппорта с этой матерью. Чувствовал себя отвратительно :(

source: My main focus while working on increasing gross income features is balance. This thin line, not a goddamn pay-to-win, but not a monastery. Games were created for people to enjoy them. Paying a few (maybe more) bucks to give a big 'thank you' to the team is great. Just remember, there are casinos in real life, don't become a virtual one.
ru: Моя главная цель при работе с монетизацией - баланс. Оставаться на этой тонкой грани, не выливаться в pay-2-win, но не ограничивать себя во всем. Закинуть пару сотен (может не сотен) как 'спасибо' разрабам - святое дело. Единственное, что надо помнить - казино есть в реальной жизни, не делайте еще одно здесь :(

source: Even if there's nothing to do sometimes, player could be held for some more of that sweet session length metric. Just give him some solo (or not) quests!
ru: Даже если делать нечего, игрока всегда можно удержать чуточку подольше ради этих сладких метрик. Просто дайте ему квестов!

source: Daily quests is one of my first features that went into production. Truly, I was proud of myself that day! And still am. That was kinda sloppy, we had to fix some mistakes first day (QA is important, fellas!), but we've managed to complete our objective. Covering the whole game with small tasks, some can be completed even without thinking of them. We all know, if you complete one, you gotta finish them all. Actually, this feature was such a meme potential. Surely, that came true! Almost every quest name was some kind of a meme haha. Some are still known to mass public, some were forgotten a long time ago. The only disappointment was the announcement. Our secret three-month streak was just published, that was a huge fail. Though, I'm still getting sentimental about this thing haha
ru: Дейлики это одна из моих первых фичей, которая вышла в прод. На самом деле, я очень гордился собой в тот момент, да и сейчас тоже. Немного хорошего, немного лажи, нам пришлось чинить пару ошибок в первый день (поэтому хороший QA это важно!), но результат удовлетворил как меня, так и игроков. Покрыли почти все игровые фичи небольшими задачками, некоторые выполнялись в процесссе геймплея. А мы все знаем, если сделал одну и увидел это, постараешься сделать все. На самом деле это был такой мемный потенциал, который к счастью был реализован. Почти каждый дейлик имел мемное название. Тут пошло все - актуальные мемы, мемы из прошлого, забытые годами или десятилетиями мемы. Единственное разочарование - это то, как объявили эти дейлики. Тогда спалили добавленный мной секретный стрик в 84 дня, вот это был фейл. Но все равно вспоминаю с комфортом и люблю эту фичу с:

source: Had some time working with quest lines for different types of players (have you found my factions page?). A quick 'welcome to our game' quest, where we show some core features, mostly a guide through your first day. 'Do *action* N times' is a last resort quest. Yeah, it's not a bad thing to hold player at some feature until they understand its basics, but I've seen a quest like 'collect 150 seeds'. Every action lasted 10-15 seconds, so you had to sit 20-30 minutes clicking two keys. My favorite approach to quests is giving some condition, e.g. 'Capture the castle without using any healing items', 'Give a tip to the taxi driver'. Yup, it's a one time thing, but the supposed castle can make players do it a few times to suit the condition. Tipping to the taxi drives requires you to use a taxi, interact with another player and move somewhere else. Easy, but trust me, it sounds more interesting than 'Drive the taxi 3 times' for the player.
ru: Было время и с квестлиниями для разных типов игроков (вы же уже нашли мою статью про фракции?). Небольшой велком квест, который покажет кор фичи. Это как гайд для первого дня в игрушке. Хочешь выполнять квесты дальше - займись какой-то активностью. Только без 'Выполни действие N раз' - это прям последний случай. Не, нет проблемы в том, чтобы подержать игрока на фиче, пока он в ней не разберется, но квесты формата 'собери 150 зерен', где на каждый заход уходит 10-15 секунд, а весь квест состоит из получаса кликов по двум кнопкам - это грустно. Просто грустно. Мой любимый подход к квестам - давать условия. К примеру - 'Захватите замок без лечения юнитов', 'Дайте таксисту на чай'. Да, это штука на один раз, но условный замок заставит некоторых игроков перепроходить эту активность, чтобы выполнить квест. Дать таксисту на чай требует наличие таксиста, с которым придется интерактировать, и в итоге поехать куда-нибудь. Звучит очень просто, но для игрока это выглядит комфортнее, чем 'Прокатитесь на такси 3 раза' (что уж таить, это был один из дейликов моих, я честно стал лучше)

source: I truly enjoy quests of any type, it's an easy way to fill the player in some basic concepts or give him something to do. Just show that your project has some soul. And damn, don't make them grind :(
ru: Я очень сильно наслаждаюсь квестами любого типа. Это простой способ объяснить игроку базовые концепты или просто занять его чем-нибудь. Просто покажите, что вы проект с душой. Хай бох милуе, не заставляйте их гриндить :(

source: we all need some time alone...
ru: всем нужно время наедине с собой...
